# The Analysis of an Airline Customers Activities in Canada from 2012 to 2018

### The Analysis Project Seeks to Answer the Following Questions

Top 5 province with highest flights booking

Top 5 province with highest dollar cost redeemed 

Top 5 province with highest flights booked with companion 

Flights booking per gender

Salary earnings per gender

Flights booked per year 

Find the relationship between flights booked and salary earned by customers per educational level

Distribution of customers by education 

Number of enrollments into promotional offers by month

Number of enrollments into standard offers by year 

Distribution of customers by marital status

Distribution of salary earnings by city 

Maximum salary earned by customers by educational level 

Share of Total salary earned by customers who are divorced, holds bachelors degree and enrolled on standard type of offer 

Share of Total salary earned by customers who are single, holds bachelors degree and enrolled on standard type of offer 

Share of Total salary earned by customers who are married, holds bachelors degree and enrolled on standard type of offer 

Average salary earned by customers who are divorced, holds bachelors degree and enrolled on standard type of offer 

Average salary earned by customers who are single, holds bachelors degree and enrolled on standard type of offer

### Explanation of the various fields in the dataset
Loyalty Number: Customers unique loyalty number ***
Year: Year of the period ***
Month: Month of the period ***
Flights Booked: Number of flights booked for member only in the period ***
Flights with Companions:	Number of flights booked with additional passengers in the period ***
Total Flights:	Sum of Flights Booked and Flights with Companions ***
Distance:	Flight distance traveled in the period (km) ***
Points Accumulated:	Loyalty points accumulated in the period ***
Points Redeemed:	Loyalty points redeemed in the period ***
Dollar Cost Points Redeemed:	Dollar equivalent for points redeemed in the period in CDN ***
Country:	Country of residence ***
Province:	Province of residence ***
City:	City of residence ***
Gender:	Gender ***
Education:	Highest education level (High school or lower > College > Bachelor > Master > Doctor) ***
Salary:	Annual income ***
Marital Status:	Marital status (Single, Married, Divorced) ***
Enrollment Type:	Enrollment type (Standard / 2018 Promotion) ***
Enrollment Year:	Year Member enrolled in membership program ***
Enrollment Month:	Month Member enrolled in membership program ***
Cancellation Year:	Year Member cancelled their membership ***
Cancellation Month:	Month Member cancelled their membership ***

In [1]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline
import plotly.express as px
import warnings
warnings.simplefilter(action='ignore', category=FutureWarning)

In [2]:
pd.set_option('display.max_columns', None)

In [3]:
df1 = pd.read_csv("Customer Loyalty History.csv")
df2 = pd.read_csv("Customer Flight Activity.csv")

In [4]:
mgddf = df1.merge(df2, how='outer')

In [5]:
mgddf.head(3)

,Loyalty Number,Country,Province,City,Postal Code,Gender,Education,Salary,Marital Status,Loyalty Card,CLV,Enrollment Type,Enrollment Year,Enrollment Month,Cancellation Year,Cancellation Month,Year,Month,Flights Booked,Flights with Companions,Total Flights,Distance,Points Accumulated,Points Redeemed,Dollar Cost Points Redeemed
0,480934,Canada,Ontario,Toronto,M2Z 4K1,Female,Bachelor,83236,Married,Star,3839.14,Standard,2016,2,0,0,2017,1,0,0,0,0,0.0,0,0
1,480934,Canada,Ontario,Toronto,M2Z 4K1,Female,Bachelor,83236,Married,Star,3839.14,Standard,2016,2,0,0,2017,2,3,0,3,2823,282.0,0,0
2,480934,Canada,Ontario,Toronto,M2Z 4K1,Female,Bachelor,83236,Married,Star,3839.14,Standard,2016,2,0,0,2017,3,0,0,0,0,0.0,0,0

In [6]:
#Dropping non-relevant fields in the dataset
mgddf.drop(columns = ["Postal Code","Loyalty Card","CLV"],inplace = True)

In [7]:
mgddf.head(3)

,Loyalty Number,Country,Province,City,Gender,Education,Salary,Marital Status,Enrollment Type,Enrollment Year,Enrollment Month,Cancellation Year,Cancellation Month,Year,Month,Flights Booked,Flights with Companions,Total Flights,Distance,Points Accumulated,Points Redeemed,Dollar Cost Points Redeemed
0,480934,Canada,Ontario,Toronto,Female,Bachelor,83236,Married,Standard,2016,2,0,0,2017,1,0,0,0,0,0.0,0,0
1,480934,Canada,Ontario,Toronto,Female,Bachelor,83236,Married,Standard,2016,2,0,0,2017,2,3,0,3,2823,282.0,0,0
2,480934,Canada,Ontario,Toronto,Female,Bachelor,83236,Married,Standard,2016,2,0,0,2017,3,0,0,0,0,0.0,0,0

In [8]:
mgddf.columns

Index(['Loyalty Number', 'Country', 'Province', 'City', 'Gender', 'Education',
       'Salary', 'Marital Status', 'Enrollment Type', 'Enrollment Year',
       'Enrollment Month', 'Cancellation Year', 'Cancellation Month', 'Year',
       'Month', 'Flights Booked', 'Flights with Companions', 'Total Flights',
       'Distance', 'Points Accumulated', 'Points Redeemed',
       'Dollar Cost Points Redeemed'],
      dtype='object')

In [9]:
#Checking to against the presence of null values
mgddf.isna().sum()

Loyalty Number                 0
Country                        0
Province                       0
City                           0
Gender                         0
Education                      0
Salary                         0
Marital Status                 0
Enrollment Type                0
Enrollment Year                0
Enrollment Month               0
Cancellation Year              0
Cancellation Month             0
Year                           0
Month                          0
Flights Booked                 0
Flights with Companions        0
Total Flights                  0
Distance                       0
Points Accumulated             0
Points Redeemed                0
Dollar Cost Points Redeemed    0
dtype: int64

In [10]:
mgddf.shape

(405624, 22)

In [11]:
mgddf.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 405624 entries, 0 to 405623
Data columns (total 22 columns):
 #   Column                       Non-Null Count   Dtype
---  ------                       --------------   -----
 0   Loyalty Number               405624 non-null  int64
 1   Country                      405624 non-null  object
 2   Province                     405624 non-null  object
 3   City                         405624 non-null  object
 4   Gender                       405624 non-null  object
 5   Education                    405624 non-null  object
 6   Salary                       405624 non-null  int64
 7   Marital Status               405624 non-null  object
 8   Enrollment Type              405624 non-null  object
 9   Enrollment Year              405624 non-null  int64
 10  Enrollment Month             405624 non-null  int64
 11  Cancellation Year            405624 non-null  int64
 12  Cancellation Month           405624 non-null  int64
 13  Year                         405624 non-null  int64
 14  Month                        405624 non-null  int64
 15  Flights Booked               405624 non-null  int64
 16  Flights with Companions      405624 non-null  int64
 17  Total Flights                405624 non-null  int64
 18  Distance                     405624 non-null  int64
 19  Points Accumulated           405624 non-null  float64
 20  Points Redeemed              405624 non-null  int64
 21  Dollar Cost Points Redeemed  405624 non-null  int64
dtypes: float64(1), int64(14), object(7)
memory usage: 71.2+ MB

In [13]:
#Statistical exploration of the dataset

mgddf[["Salary","Flights Booked","Flights with Companions","Total Flights","Distance","Points Accumulated","Points Redeemed","Dollar Cost Points Redeemed"]].describe()

,Salary,Flights Booked,Flights with Companions,Total Flights,Distance,Points Accumulated,Points Redeemed,Dollar Cost Points Redeemed
count,405624.000000,405624.000000,405624.000000,405624.000000,405624.000000,405624.000000,405624.000000,405624.000000
mean,59204.212177,4.115052,1.031805,5.146858,1208.880059,123.692721,30.696872,2.484503
std,45852.232458,5.225518,2.076869,6.521227,1433.155320,146.599831,125.486049,10.150038
min,-58486.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
50%,63669.000000,1.000000,0.000000,1.000000,488.000000,50.000000,0.000000,0.000000
75%,82940.000000,8.000000,1.000000,10.000000,2336.000000,239.000000,0.000000,0.000000
max,407228.000000,21.000000,11.000000,32.000000,6293.000000,676.500000,876.000000,71.000000

In [ ]:
Index(['Loyalty Number', 'Country', 'Province', 'City', 'Gender', 'Education',
       'Salary', 'Marital Status', 'Enrollment Type', 'Enrollment Year',
       'Enrollment Month', 'Cancellation Year', 'Cancellation Month', 'Year',
       'Month', 'Flights Booked', 'Flights with Companions', 'Total Flights',
       'Distance', 'Points Accumulated', 'Points Redeemed',
       'Dollar Cost Points Redeemed'],
      dtype='object')

In [14]:
##Top 5 province with highest flights booking

mgddf.groupby(["Province"]).sum()["Flights Booked"].sort_values(ascending = False)[:5]

Province
Ontario             540138
British Columbia    440526
Quebec              324553
Alberta              98079
New Brunswick        66118
Name: Flights Booked, dtype: int64

In [54]:
mgddf.groupby(["Province"]).sum()["Flights Booked"].sort_values(ascending = False)[:5]

Province
Ontario             540138
British Columbia    440526
Quebec              324553
Alberta              98079
New Brunswick        66118
Name: Flights Booked, dtype: int64

In [15]:
##Top 5 province with highest dollar cost redeemed 

mgddf.groupby(["Province"]).sum()["Dollar Cost Points Redeemed"].sort_values(ascending = False)[:5]

Province
Ontario             324714
British Columbia    266053
Quebec              201410
Alberta              57509
New Brunswick        39039
Name: Dollar Cost Points Redeemed, dtype: int64

In [16]:
##Top 5 province with highest flights booked with companion 

mgddf.groupby(["Province"]).sum()["Flights with Companions"].sort_values(ascending = False)[:5]

Province
Ontario             135630
British Columbia    110609
Quebec               81063
Alberta              24128
New Brunswick        16496
Name: Flights with Companions, dtype: int64

In [17]:
##Mean Flights booking per gender

mgddf.groupby(["Gender"]).mean()["Total Flights"].sort_values(ascending = False)

Gender
Male      5.177460
Female    5.116505
Name: Total Flights, dtype: float64

In [18]:
##Mean Salary earnings per gender

mgddf.groupby(["Gender"]).mean()["Salary"].sort_values(ascending = False)[:5]

Gender
Female    59578.276606
Male      58827.080917
Name: Salary, dtype: float64

In [19]:
##Flights booked per year 

mgddf.groupby(["Year"]).sum()["Total Flights"].sort_values(ascending = False)

Year
2018    1100121
2017     987568
Name: Total Flights, dtype: int64

In [20]:
##Find the relationship between flights booked and salary earned by customers per educational level

pd.pivot_table(mgddf, values=["Flights Booked","Salary"], index=["Education"],
                       aggfunc={"Flights Booked":"mean","Salary": "mean"})

                      Flights Booked         Salary
Education
Bachelor                    4.091093   72476.211860
College                     4.153012       0.000000
Doctor                      4.146281  178335.439516
High School or Below        4.155777   60986.544192
Master                      4.184014  103767.494163

In [21]:
##Distribution of customers by education 

mgddf.groupby(["Education"]).sum()["Loyalty Number"].sort_values(ascending = False)

Education
Bachelor                139116216960
College                  56419893648
High School or Below     10610585016
Doctor                   10190939592
Master                    6770927016
Name: Loyalty Number, dtype: int64

In [22]:
##Number of enrollments into promotional offers by month

mgddfP = mgddf[["Enrollment Type","Month"]]

In [23]:
mgddfP1 = mgddfP[(mgddfP["Enrollment Type"] == "Promotion") & (["Month"])]

In [24]:
mgddfP1["Month"].count()

23424

In [25]:
mgddf["Enrollment Type"].value_counts()

Standard     382200
Promotion     23424
Name: Enrollment Type, dtype: int64

In [26]:
##Number of enrollments into standard offers by year 

mgddfY = mgddf[["Enrollment Type","Enrollment Year"]]

In [27]:
mgddfY1 = mgddfY[(mgddfY["Enrollment Type"] == "Promotion") & (["Enrollment Year"])]

In [28]:
mgddfY1["Enrollment Year"].count()

23424

In [29]:
#Share of customers enrollment into offers by year
mgddf["Enrollment Year"].value_counts()

2018    72816
2017    60432
2016    59520
2013    58032
2014    57288
2015    56520
2012    41016
Name: Enrollment Year, dtype: int64

In [30]:
##Distribution of customers by marital status

mgddf["Marital Status"].value_counts()

Married     235800
Single      108648
Divorced     61176
Name: Marital Status, dtype: int64

In [31]:
##Distribution of salary earnings by city 
mgddf.groupby(["City"]).sum()["Salary"].sort_values(ascending = False)[:10]

City
Toronto         4781844216
Vancouver       3697639176
Montreal        2891027328
Winnipeg         926942664
Whistler         816081192
Halifax          768015816
Ottawa           720470448
Quebec City      713040360
Trenton          689712696
Dawson Creek     674511768
Name: Salary, dtype: int64

In [32]:
##Distribution of salary earnings by city 
mgddf.groupby(["City"]).mean()["Salary"].sort_values(ascending = False)[:10]

City
Hull            66918.574586
Fredericton     63892.155452
Tremblant       63315.695000
Moncton         62655.419811
Dawson Creek    62593.890869
Thunder Bay     61455.831418
Halifax         61069.959924
Quebec City     60632.683673
Peace River     60606.849558
Calgary         60114.968586
Name: Salary, dtype: float64

In [33]:
#Maximum salary earned by customers by educational level
mgddf.groupby(["Education"]).max()["Salary"].sort_values(ascending = False)

Education
Doctor                  407228
Master                  133080
Bachelor                105563
High School or Below     93875
College                      0
Name: Salary, dtype: int64

In [34]:
#Top 5 province with highest salary earnings
mgddf.groupby("Province").sum()["Salary"].sort_values(ascending = False)[:5]

Province
Ontario             7699209912
British Columbia    6329303568
Quebec              4793286936
Alberta             1349534208
New Brunswick        979691232
Name: Salary, dtype: int64

In [35]:
slcdf = mgddf[["Salary","Marital Status","Education","Enrollment Type"]]

In [36]:
#Slicing the dataset using groupby function. To find the salary distribution via education and enrollment type.
slcdf.groupby(["Marital Status","Education","Enrollment Type"]).sum()["Salary"]

Marital Status  Education             Enrollment Type
Divorced        Bachelor              Promotion            156606336
                                      Standard            2735645544
                College               Promotion                    0
                                      Standard                     0
                Doctor                Promotion             36758520
                                      Standard             765990336
                High School or Below  Promotion             11247456
                                      Standard             177058296
                Master                Promotion             23499648
                                      Standard             445651584
Married         Bachelor              Promotion            616747512
                                      Standard           11894484432
                College               Promotion                    0
                                      Standard                     0
                Doctor                Promotion            157965480
                                      Standard            1879967304
                High School or Below  Promotion             47223648
                                      Standard             720937680
                Master                Promotion             10591776
                                      Standard             524595720
Single          Bachelor              Promotion            162618336
                                      Standard            2824881552
                College               Promotion                    0
                                      Standard                     0
                Doctor                Promotion             17681400
                                      Standard             325994568
                High School or Below  Promotion             15127848
                                      Standard             187637304
                Master                Promotion             11073240
                                      Standard             264663840
Name: Salary, dtype: int64

In [37]:
#Total salary earned by customers who are divorced, holds bachelors degree and enrolled on standard type of offer


slcdf1 = slcdf[(slcdf["Salary"]>1) & (slcdf["Marital Status"]=="Divorced") & (slcdf["Education"]=="Bachelor") & (slcdf["Enrollment Type"]=="Standard")]
slcdf1.groupby(["Marital Status","Education","Enrollment Type"]).sum()["Salary"]

Marital Status  Education  Enrollment Type
Divorced        Bachelor   Standard           2735645544
Name: Salary, dtype: int64

In [38]:
slcdf1.groupby(["Marital Status","Education","Enrollment Type"]).sum()["Salary"]
print("The total earning by customers who Divorced, Bachelor holders who are on Standard enrollment is:2735645544")

The total earning by customers who Divorced, Bachelor holders who are on Standard enrollment is:2735645544

In [55]:
#Share of Total salary earned by customers who are single, holds bachelors degree and enrolled on standard type of offer


slcdf2 = slcdf[(slcdf["Salary"]>1) & (slcdf["Marital Status"]=="Single") & (slcdf["Education"]=="Bachelor") & (slcdf["Enrollment Type"]=="Standard")]
slcdf2.groupby(["Marital Status","Education","Enrollment Type"]).sum()["Salary"]

Marital Status  Education  Enrollment Type
Single          Bachelor   Standard           2824881552
Name: Salary, dtype: int64

In [39]:
print("The total earning by customers who single, Bachelor holders who are on Standard enrollment is:2824881552")

The total earning by customers who single, Bachelor holders who are on Standard enrollment is:2824881552

In [40]:
#Share of Total salary earned by customers who are married, holds bachelors degree and enrolled on standard type of offer

slcdf3 = slcdf[(slcdf["Salary"]>1) & (slcdf["Marital Status"]=="Married") & (slcdf["Education"]=="Bachelor") & (slcdf["Enrollment Type"]=="Standard")]
slcdf3.groupby(["Marital Status","Education","Enrollment Type"]).sum()["Salary"]

Marital Status  Education  Enrollment Type
Married         Bachelor   Standard           11894484432
Name: Salary, dtype: int64

In [41]:
print("The total earning by customers who married, Bachelor holders who are on Standard enrollment is:11894484432")

The total earning by customers who married, Bachelor holders who are on Standard enrollment is:11894484432

In [42]:
#Average salary earned by customers who are divorced, holds bachelors degree and enrolled on standard type of offer

slcdf4 = slcdf[(slcdf["Salary"]>1) & (slcdf["Marital Status"]=="Divorced") & (slcdf["Education"]=="Bachelor") & (slcdf["Enrollment Type"]=="Standard")]
slcdf4.groupby(["Marital Status","Education","Enrollment Type"]).mean()["Salary"]

Marital Status  Education  Enrollment Type
Divorced        Bachelor   Standard           73067.455769
Name: Salary, dtype: float64

In [43]:
print("The avaerage earning by customers who divorced, Bachelor holders who are on Standard enrollment is: 73067.455769")

The avaerage earning by customers who divorced, Bachelor holders who are on Standard enrollment is: 73067.455769

In [44]:
#Average salary earned by customers who are single, holds bachelors degree and enrolled on standard type of offer

slcdf5 = slcdf[(slcdf["Salary"]>1) & (slcdf["Marital Status"]=="Single") & (slcdf["Education"]=="Bachelor") & (slcdf["Enrollment Type"]=="Standard")]
slcdf5.groupby(["Marital Status","Education","Enrollment Type"]).mean()["Salary"]

Marital Status  Education  Enrollment Type
Single          Bachelor   Standard           72522.118299
Name: Salary, dtype: float64

In [45]:
print("The avaerage earning by customers who single, Bachelor holders who are on Standard enrollment is: 72522.118299")

The avaerage earning by customers who single, Bachelor holders who are on Standard enrollment is: 72522.118299